namespace Jrd
{
    public struct IDEAS
    {
        // зум запилить на мышку
        // выбираем префаб, он зацеплен за курсор + за граунд
        // двигаем и позишн снапается к сетке
        // жмем ок и префаб ставится в выбранную точку
        // точка меняет свой стэйт


        // управление на мобилке


        // BUILDING

        // 0. Выбираем префаб
        // 1. найти точку сетки по центру экрана
        // 2. спавним выбранный префаб
        // 3. показываем меню передвижения
        // 4. пробиваем состояние затрагиваемых точек
        // 5. отображаем заняты или не заняты точки
        // 6. мувинг объекта за счет стандартного мувинга + прилипание
        // 7. кнопка апплая с проверкой точек еще раз и установкой стэйта точек которые попадают под влияние
        // 8. запись данных в точки
    }
}